In [1]:
!ls

Activity 1.01.ipynb           titanic-Copy1.csv
Exercises -1.01 to 1.05.ipynb

Use pandas to load the Titanic dataset and use the head function on the dataset to display the top rows of the dataset. Describe the summary data for all columns.

In [2]:
import pandas as pd
import numpy as np

In [17]:
data = pd.read_csv('titanic-Copy1.csv')

In [4]:
data.head(5)

,Unnamed: 0,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
0,0,NaN,S,7.2500,3,A/5 21171,22.0,"Braund, Mr. Owen Harris",0,male,1,0.0
1,1,C85,C,71.2833,1,PC 17599,38.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,female,1,1.0
2,2,NaN,S,7.9250,3,STON/O2. 3101282,26.0,"Heikkinen, Miss. Laina",0,female,0,1.0
3,3,C123,S,53.1000,1,113803,35.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,female,1,1.0
4,4,NaN,S,8.0500,3,373450,35.0,"Allen, Mr. William Henry",0,male,0,0.0

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1309 non-null   int64
 1   Cabin       295 non-null    object
 2   Embarked    1307 non-null   object
 3   Fare        1308 non-null   float64
 4   Pclass      1309 non-null   int64
 5   Ticket      1309 non-null   object
 6   Age         1046 non-null   float64
 7   Name        1309 non-null   object
 8   Parch       1309 non-null   int64
 9   Sex         1309 non-null   object
 10  SibSp       1309 non-null   int64
 11  Survived    891 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 122.8+ KB

In [63]:
data.describe(include='all')

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
count,295,1307,1308.000000,1309.000000,1309,1046.000000,1309,1309.000000,1309,1309.000000,891.000000
unique,186,3,NaN,NaN,929,NaN,1307,NaN,2,NaN,NaN
top,C23 C25 C27,S,NaN,NaN,CA. 2343,NaN,"Kelly, Mr. James",NaN,male,NaN,NaN
freq,6,914,NaN,NaN,11,NaN,2,NaN,843,NaN,NaN
mean,NaN,NaN,33.295479,2.294882,NaN,29.881138,NaN,0.385027,NaN,0.498854,0.383838
std,NaN,NaN,51.758668,0.837836,NaN,14.413493,NaN,0.865560,NaN,1.041658,0.486592
min,NaN,NaN,0.000000,1.000000,NaN,0.170000,NaN,0.000000,NaN,0.000000,0.000000
25%,NaN,NaN,7.895800,2.000000,NaN,21.000000,NaN,0.000000,NaN,0.000000,0.000000
50%,NaN,NaN,14.454200,3.000000,NaN,28.000000,NaN,0.000000,NaN,0.000000,0.000000
75%,NaN,NaN,31.275000,3.000000,NaN,39.000000,NaN,0.000000,NaN,1.000000,1.000000
max,NaN,NaN,512.329200,3.000000,NaN,80.000000,NaN,9.000000,NaN,8.000000,1.000000

We don't need the Unnamed: 0 column. In Exercise 1.03: Advanced Indexing and Selection, we demonstrated how to remove the column using the del command. How else could we remove this column? Remove this column without using del.

In [8]:
#del data['Unnamed: 0']

In [18]:
data.drop(['Unnamed: 0'],axis = 1,inplace=True)

In [19]:
data.head()

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
0,NaN,S,7.2500,3,A/5 21171,22.0,"Braund, Mr. Owen Harris",0,male,1,0.0
1,C85,C,71.2833,1,PC 17599,38.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,female,1,1.0
2,NaN,S,7.9250,3,STON/O2. 3101282,26.0,"Heikkinen, Miss. Laina",0,female,0,1.0
3,C123,S,53.1000,1,113803,35.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,female,1,1.0
4,NaN,S,8.0500,3,373450,35.0,"Allen, Mr. William Henry",0,male,0,0.0

Compute the mean, standard deviation, minimum, and maximum values for the columns of the DataFrame without using describe. Note that you can find the minimum and maximum values using the df.min() and df.max() functions.

In [20]:
data.mean()

Fare        33.295479
Pclass       2.294882
Age         29.881138
Parch        0.385027
SibSp        0.498854
Survived     0.383838
dtype: float64

In [21]:
data.std()

Fare        51.758668
Pclass       0.837836
Age         14.413493
Parch        0.865560
SibSp        1.041658
Survived     0.486592
dtype: float64

In [22]:
data.max()

Fare                            512.329
Pclass                                3
Ticket                        WE/P 5735
Age                                  80
Name        van Melkebeke, Mr. Philemon
Parch                                 9
Sex                                male
SibSp                                 8
Survived                              1
dtype: object

In [23]:
data.min()

Fare                          0
Pclass                        1
Ticket                   110152
Age                        0.17
Name        Abbing, Mr. Anthony
Parch                         0
Sex                      female
SibSp                         0
Survived                      0
dtype: object

Use the quantile method to get values for the 33, 66, and 99% quantiles.

In [25]:
data.quantile(.33)

Fare         8.559325
Pclass       2.000000
Age         23.000000
Parch        0.000000
SibSp        0.000000
Survived     0.000000
Name: 0.33, dtype: float64

In [27]:
data.quantile(.66)

Fare        26.0
Pclass       3.0
Age         34.0
Parch        0.0
SibSp        0.0
Survived     1.0
Name: 0.66, dtype: float64

In [28]:
data.quantile(.99)

Fare        262.375
Pclass        3.000
Age          65.000
Parch         4.000
SibSp         5.000
Survived      1.000
Name: 0.99, dtype: float64

Find how many passengers were from each class using the groupby method.

In [29]:
pclass_group = data.groupby('Pclass')

In [37]:
for grp_name, dataframe in pclass_group:
    print(f' group name: {grp_name}, number of passanger: {dataframe.shape[0]} \n')

 group name: 1, number of passanger: 323

 group name: 2, number of passanger: 277

 group name: 3, number of passanger: 709

In [64]:
for name , index in pclass_group:
    print(f' group name: {name}, number: {len(index)} ')

 group name: 1, number: 323
 group name: 2, number: 277
 group name: 3, number: 709

Find how many passengers were from each class answer by using selecting/indexing methods to count the members of each class. You can use the unique() method to find out the unique values of each class. Confirm that the answers to Step 6 and Step 7 match.

In [48]:
data.Pclass.unique()

array([3, 1, 2])

In [50]:
pclass_1 = data[data.Pclass == 1]
len(pclass_1)

323

In [52]:
pclass_2 = data[data.Pclass == 2]
len(pclass_2)

277

In [53]:
pclass_3 = data[data.Pclass == 3]
len(pclass_3)

709

In [65]:
for cls_name in data.Pclass.unique():
    number = len(data[data.Pclass == cls_name])
    print(f" class name: {cls_name} number: {number}")

 class name: 3 number: 709
 class name: 1 number: 323
 class name: 2 number: 277

Determine who the eldest passenger in third class was.

In [56]:
eldest = pclass_3[ pclass_3.Age == pclass_3.Age.max()]
eldest

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
851,NaN,S,7.775,3,347060,74.0,"Svensson, Mr. Johan",0,male,0,0.0

For a number of machine learning problems, it is very common to scale the numerical values between 0 and 1. Use the agg method with Lambda functions to scale the Fare and Age columns between 0 and 1.

In [67]:
fare = data.Fare.max()
age = data.Age.max()

In [70]:
data.agg({
    'Fare': lambda x: x/fare,
    'Age': lambda x: x/age
                 })

          Fare      Age
0     0.014151  0.27500
1     0.139136  0.47500
2     0.015469  0.32500
3     0.103644  0.43750
4     0.015713  0.43750
...        ...      ...
1304  0.015713      NaN
1305  0.212559  0.48750
1306  0.014151  0.48125
1307  0.015713      NaN
1308  0.043640      NaN

[1309 rows x 2 columns]

There is one individual in the dataset without a listed Fare value, which can be established as follows:

In [61]:
data[np.isnan(data.Fare)]

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
1043,NaN,S,NaN,3,3701,60.5,"Storey, Mr. Thomas",0,male,0,NaN

In [72]:
df_fare_nan = data.loc[(data.Fare.isna())]
df_fare_nan

,Cabin,Embarked,Fare,Pclass,Ticket,Age,Name,Parch,Sex,SibSp,Survived
1043,NaN,S,NaN,3,3701,60.5,"Storey, Mr. Thomas",0,male,0,NaN

Replace the NaN value of this row in the main DataFrame with the mean Fare value for those corresponding to the same class and Embarked location using the groupby method. The output will be as follows:

In [79]:
embarked_class_group = data.groupby(['Embarked', 'Pclass'])
embarked_class_group.groups

{('S',
  3): Int64Index([   0,    2,    4,    7,    8,   10,   12,   13,   14,   18,
             ...
             1277, 1280, 1283, 1285, 1289, 1300, 1303, 1304, 1306, 1307],
            dtype='int64', length=495),
 ('C',
  1): Int64Index([   1,   30,   31,   34,   52,   54,   64,   96,   97,  118,
             ...
             1241, 1255, 1259, 1262, 1266, 1288, 1293, 1295, 1298, 1305],
            dtype='int64', length=141),
 ('S',
  1): Int64Index([   3,    6,   11,   23,   27,   35,   55,   62,   83,   88,
             ...
             1246, 1247, 1263, 1265, 1269, 1281, 1282, 1286, 1291, 1294],
            dtype='int64', length=177),
 ('Q',
  3): Int64Index([   5,   16,   22,   28,   32,   44,   46,   47,   82,  109,
             ...
             1204, 1206, 1249, 1271, 1272, 1279, 1287, 1290, 1299, 1301],
            dtype='int64', length=113),
 ('C',
  2): Int64Index([   9,   43,  122,  135,  181,  292,  308,  361,  389,  473,  547,
              608,  685,  817,  827,  866,  874,  906,  942,  945, 1001, 1111,
             1155, 1187, 1192, 1252, 1260, 1296],
            dtype='int64'),
 ('S',
  2): Int64Index([  15,   17,   20,   21,   33,   41,   53,   56,   58,   66,
             ...
             1253, 1261, 1264, 1268, 1275, 1276, 1278, 1284, 1292, 1297],
            dtype='int64', length=242),
 ('C',
  3): Int64Index([  19,   26,   36,   39,   42,   48,   57,   60,   65,   73,
             ...
             1188, 1202, 1212, 1223, 1224, 1228, 1230, 1238, 1257, 1308],
            dtype='int64', length=101),
 (nan, 1): Int64Index([61, 829], dtype='int64'),
 ('Q', 1): Int64Index([245, 412, 1302], dtype='int64'),
 ('Q', 2): Int64Index([303, 322, 626, 893, 907, 975, 1084], dtype='int64')}

In [77]:
indices = embarked_class_group.groups[df_fare_nan.Embarked.values[0], df_fare_nan.Pclass.values[0]]
indices

Int64Index([   0,    2,    4,    7,    8,   10,   12,   13,   14,   18,
            ...
            1277, 1280, 1283, 1285, 1289, 1300, 1303, 1304, 1306, 1307],
           dtype='int64', length=495)

In [84]:
mean_fare = data.iloc[indices].Fare.mean()
mean_fare

14.435422064777338

In [85]:
data.loc[(data.index==1043), 'Fare']= mean_fare

In [87]:
data.iloc[1043]

Cabin                      NaN
Embarked                     S
Fare                   14.4354
Pclass                       3
Ticket                    3701
Age                       60.5
Name        Storey, Mr. Thomas
Parch                        0
Sex                       male
SibSp                        0
Survived                   NaN
Name: 1043, dtype: object